<script setup>
import net14 from "@/assets/images/net14.png";
import { useRouter } from "vue-router";
const router = useRouter();

const content = `
东方红集团重视您的隐私。本隐私政策解释了当您使用东方红集团提供的服务时，我们如何收集、使用、存储和保护您的个人信息，以及您如何行使您的隐私权利。

<br /><br />1. 信息收集
<br />我们收集的信息包括但不限于：

<br /><br />个人识别信息：如姓名、地址、电子邮件地址和电话号码。
<br />技术信息：如您的IP地址、浏览器类型和版本、设备类型、操作系统以及访问时间和日期。
<br />使用信息：包括您如何使用我们的网站和服务，以及您访问的页面。
<br /><br />2. 信息使用
<br />我们使用收集的信息来：

<br /><br />提供、操作和改进我们的服务。
<br />理解和分析您对服务的使用方式和偏好，以提升您的用户体验。
<br />与您沟通，包括提供服务更新、安全警告和支持消息。
<br />进行市场研究和分析，以改善我们的产品和服务。
<br /><br />3. 信息共享
<br />除非得到您的同意，我们不会与任何第三方分享您的个人信息，以下情况除外：

<br />合作伙伴：与提供服务有关的合作公司和个人可能会访问部分信息，例如提供服务器托管和维护服务的供应商。
<br />法律要求：在法律要求、法院命令或政府和执法机关的要求下，我们可能会披露您的信息。
<br /><br />4. 信息安全
<br />我们采用行业标准的安全措施保护存储的个人信息，防止未经授权访问、公开、修改或破坏：

<br />使用加密技术保护数据。
<br />限制对个人信息的访问权，只有在必要时才授予访问权。
<br />定期对安全政策和程序进行审查和更新。
<br /><br />5. 用户权利
<br />您有权访问、更正或删除您的个人信息。您也可以限制或反对我们处理您的信息：

<br />访问和更新：您可以直接在我们的网站上访问并更新您的账户信息。
<br />删除：您可以请求我们删除您的个信息，除非我们因法律原因需要保留该信息。
<br /><br />6. 存储和数据传输
<br />我们在全球多个地点存储和处理数据，可能包括位于您所在国家/地区之外的国家。我们采取措施确保跨境传输符合适用法律的要求。

<br /><br />7. 政策更新
<br />我们可能会不时更新此隐私政策。任何更改将通过我们的网站发布，并在更新后立即生效。
`;

const onBack = () => {
  router.push("/");
};
</script>

<template>
  <a-header />
  <a-banner zh="隐私安全" en="Privacy security" :src="net14" />
  <a-article title="隐私政策" :content="content" @back="onBack" />
  <a-footer />
</template>
