<script setup>
import net13 from '@/assets/images/net13.png'
import { useRouter } from "vue-router";
const router = useRouter();

const content = `
  一、引言

  <br /><br />我们非常重视用户的隐私保护，因此制定了本隐私条款。本隐私条款旨在明确我们如何收集、使用、存储和保护您的个人信息。请您在使用我们的服务之前，仔细阅读并理解本隐私条款的内容。

  <br /><br />二、个人信息的收集

  <br /><br />为了向您提供更好的服务，我们可能需要收集您的个人信息。这些信息包括但不限于您的姓名、联系方式、电子邮箱地址、设备信息、IP地址等。我们仅在您自愿提供或法律允许的情况下收集这些信息。

  <br /><br />三、个人信息的使用

  <br /><br />我们将严格按照相关法律法规的规定，使用您提供的个人信息。我们可能将您的个人信息用于以下目的：

  <br />提供服务：为了向您提供所需的服务或功能，我们可能需要使用您的个人信息。
  <br />改进产品：我们可能会分析您的使用习惯，以优化我们的产品或服务。
  <br />营销推广：在遵守相关法律法规的前提下，我们可能会通过电子邮件、短信等方式向您发送有关我们产品或服务的推广信息。
  <br />四、个人信息的存储与保护

  <br /><br />我们将采取合理的安全措施来保护您的个人信息，防止信息泄露、丢失或被非法获取。我们会对收集到的个人信息进行加密存储，并限制对数据的访问权限。

  <br /><br />五、信息共享与披露

  <br /><br />我们不会将您的个人信息共享给第三方，除非在以下情况下：

  <br />您的同意：在获得您明确同意的情况下，我们可能会将您的个人信息共享给第三方。
  <br />法律规定：在法律法规要求或允许的情况下，我们可能需要向有关部门提供您的个人信息。
  <br />合作伙伴：为了向您提供更好的服务，我们可能会与合作伙伴共享您的部分信息，但我们将确保合作伙伴遵守相同的隐私保护标准。
  <br />六、用户权利

  <br /><br />您有权要求我们更正、删除或限制处理您的个人信息。如果您对我们的隐私政策有任何疑问或建议，请随时与我们联系。

  <br /><br />请注意，本隐私条款可能随时更新，请您定期查看以了解最新内容。
`;

const onBack = () => {
  router.push("/");
};
</script>

<template>
  <a-header />
  <a-banner zh="隐私条款" en="Privacy policy" :src="net13" />
  <a-article title="隐私条款" :content="content" @back="onBack" />
  <a-footer />
</template>
