<script setup>
import net23 from '@/assets/images/net23.png'
import { useRouter } from "vue-router";
const router = useRouter();

const content = `
欢迎访问东方红集团官方网站。在您使用本网站之前，请仔细阅读以下法律声明。继续使用本网站意味着您已阅读、理解并同意接受以下条款的约束。如果您不同意这些条款，请不要使用本网站。

<br /><br />1. 网站使用条款
<br />本网站及其内容由东方红集团提供，仅供个人和非商业用途。用户不得修改、复制、分发、传输、展示、执行、复制、发布、授权、制作衍生作品、转让或出售任何信息、软件、产品或服务，这些信息、软件、产品或服务来源于本网站。

<br /><br />2. 知识产权
<br />本网站包含的所有内容，如文本、图形、标志、按钮图标、图像、音频剪辑、数字下载、数据编译和软件，均是东方红集团或其内容提供者的财产，受中国和国际版权法的保护。未经东方红集团明确的书面同意，严禁使用上述资料。

<br /><br />3. 商标
<br />东方红集团网站上的所有商标、服务标记和商业外观均为东方红集团或其关联公司、合作伙伴的注册商标或法定商标。未经东方红集团或相应商标持有人的书面许可，不得以任何方式使用这些标志。

<br /><br />4. 免责声明
<br />东方红集团尽力确保网站信息的准确性和时效性，但不对此做出任何保证。东方红集团对因使用本网站信息或无法访问本网站而导致的任何直接、间接、附带或特殊损害不承担责任。

<br /><br />5. 第三方链接
<br />本网站可能包含指向第三方网站的链接，这些链接仅为方便用户而提供。东方红集团对这些网站的内容不承担任何责任，对通过这些链接可能访问的网站的隐私保护措施也不做任何声明。

<br /><br />6. 法律适用和司法管辖
<br />本法律声明及您使用本网站的行为受中华人民共和国法律管辖，任何相关争议均应提交位于香港的有管辖权的法院审理。

<br /><br />7. 更新和修改
<br />东方红集团保留随时更新或修改本法律声明的权利，这些更改在本网站发布时即刻生效。用户继续使用本网站表示接受任何此类修改。
`;

const onBack = () => {
  router.push("/");
};
</script>

<template>
  <a-header />
  <a-banner zh="法律声明" en="Legal Statement" :src="net23" />
  <a-article title="法律声明" :content="content" @back="onBack" />
  <a-footer />
</template>

